import React from "react";
import { Box } from "@mui/material";
import mainPhoto from "../../assets/face.jpg"

const About = () => {
  return (
    <Box
      sx={{
        position: "relative",
        width: "100%",
        minHeight: "100vh",
        overflow: "hidden",
        color: "#fff", // טקסט לבן
      }}
    >
      {/* תמונת הרקע */}
      <Box
        sx={{
          position: "absolute",
          top: 0,
          left: 0,
          width: "100%",
          height: "100%",
          backgroundImage: `url(${mainPhoto})`,
          backgroundSize: "cover",
          backgroundPosition: "center",
          backgroundRepeat: "no-repeat",
          zIndex: -1, // מבטיח שהרקע יהיה מאחורי התוכן
          "&::after": {
            content: '""',
            position: "absolute",
            top: 0,
            left: 0,
            width: "100%",
            height: "100%",
            backgroundColor: "rgba(0, 0, 0, 0.5)", // שכבת כהות
          },
        }}
      />

      {/* טקסט "אודותיי" */}
      <Box sx={{ position: "relative", padding: "40px", maxWidth: "800px", margin: "0 auto" }}>
        <h1 style={{ textAlign: "center", fontSize: "3rem", fontWeight: "bold" }}>אודותיי</h1>
        <p style={{ lineHeight: "1.8", fontSize: "1.2rem", textAlign: "justify" }}>
          שלום! אני נתנאל, צלם מקצועי שחי ונושם את העולם הייחודי של הצילום, עם
          תשוקה עצומה לתפיסת רגעים נדירים ורגשות שלא תמיד קל לתאר במילים. אני
          מאמין שצילום הוא הרבה מעבר לתמונה יפה – זהו סיפור שלם, חוויות, ואוסף של
          רגשות שהופכים לרגעים בלתי נשכחים.
          <br />
          הדרך שלי בעולם הצילום התחילה מתוך אהבה לחקר ולגילוי, מתוך סקרנות לעולם
          סביבי ולרגעים הקטנים שמרכיבים אותו. עם השנים, הבנתי שכל תמונה היא דיאלוג
          קטן ביני לבין מה שאני רואה דרך העדשה – דיאלוג שמבוסס על אמון, חיבור
          וכבוד לרגע.
          <br />
          עבורי, כל מפגש צילומי הוא ייחודי ומותאם באופן אישי לחלומות ולרצונות שלך.
          המטרה שלי היא ליצור עבורך תמונות שמספרות את הסיפור שלך, שתוכל להביט בהן
          ולחוות מחדש את התחושות, הצבעים והריחות של אותם רגעים קסומים.
          <br />
          אני כאן כדי ללוות אותך וליצור יחד חוויות משמעותיות – בין אם מדובר באירוע
          גדול ומרגש, צילומי משפחה אינטימיים, פורטרט אישי שמשקף את האישיות שלך, או
          כל רגע שתרצה לתפוס ולשמר. יחד, נעשה זאת באווירה נינוחה ונעימה, עם הרבה
          רגישות והקפדה על הפרטים הקטנים שהופכים כל צילום לאומנות.
          <br />
          אני מזמין אותך לצאת איתי למסע שבו נבנה זיכרונות שישארו איתך לנצח – בואו
          נצלם את הסיפור שלך, את הרגעים שלך, את החיים שלך.
        </p>
      </Box>
    </Box>
  );
};

export default About;
